{"paper_title": "Amortized Control of Continuous State Space Feynman-Kac Model for Irregular Time Series", "search_title": "Amortized Control of Continuous State Space Feynman-Kac Model ...", "search_link": "https://arxiv.org/abs/2410.05602", "similarity": 0.8157894736842105, "arxiv_id": "2410.05602", "metadata": {"title": "Amortized Control of Continuous State Space Feynman-Kac Model for Irregular Time Series", "authors": ["Byoungwoo Park", "Hyungi Lee", "Juho Lee"], "abstract": "Many real-world datasets, such as healthcare, climate, and economics, are\noften collected as irregular time series, which poses challenges for accurate\nmodeling. In this paper, we propose the Amortized Control of continuous State\nSpace Model (ACSSM) for continuous dynamical modeling of time series for\nirregular and discrete observations. We first present a multi-marginal Doob's\n$h$-transform to construct a continuous dynamical system conditioned on these\nirregular observations. Following this, we introduce a variational inference\nalgorithm with a tight evidence lower bound (ELBO), leveraging stochastic\noptimal control (SOC) theory to approximate the intractable Doob's\n$h$-transform and simulate the conditioned dynamics. To improve efficiency and\nscalability during both training and inference, ACSSM employs amortized\ninference to decouple representation learning from the latent dynamics.\nAdditionally, it incorporates a simulation-free latent dynamics framework and a\ntransformer-based data assimilation scheme, facilitating parallel inference of\nthe latent states and ELBO computation. Through empirical evaluations across a\nvariety of real-world datasets, ACSSM demonstrates superior performance in\ntasks such as classification, regression, interpolation, and extrapolation,\nwhile maintaining computational efficiency.", "published": "2024-10-08T01:27:46+00:00", "updated": "2024-10-08T01:27:46+00:00", "doi": null, "primary_category": "stat.ML", "categories": ["stat.ML", "cs.LG"], "pdf_url": "http://arxiv.org/pdf/2410.05602v1", "entry_id": "http://arxiv.org/abs/2410.05602v1"}}